cyijun/ESP32MQTTClient/examples/CppEspIdf/main/main.cpp
#include <cstring>
#include <stdio.h>
#include <string>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "nvs_flash.h"
#include "esp_log.h"

#include "ESP32MQTTClient.h"

#define WIFI_SSID      "ssid"
#define WIFI_PASS      "passwd"
#define MQTT_URI       "mqtt://test.mosquitto.org:1883"

static const char *TAG = "MAIN";
ESP32MQTTClient mqttClient;

static void wifi_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    if (event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_id == WIFI_EVENT_STA_DISCONNECTED) {
        ESP_LOGI(TAG, "connect to the AP fail");
        esp_wifi_connect();
        ESP_LOGI(TAG, "retrying to connect");
    }
}

static void ip_event_handler(void* arg, esp_event_base_t event_base,
                                int32_t event_id, void* event_data)
{
    static bool mqttStarted = false;

    if (event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        ESP_LOGI(TAG, "got ip: " IPSTR, IP2STR(&event->ip_info.ip));
        if (!mqttStarted) {
            mqttStarted = mqttClient.loopStart();
            if (mqttStarted)
            {
                ESP_LOGW(TAG, "mqttClient started");
            }
            else
            {
                ESP_LOGW(TAG, "mqttClient failed to start");
            }
        }
    }
}


void wifi_init(void)
{
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    esp_event_handler_instance_t instance_any_id;
    esp_event_handler_instance_t instance_got_ip;
    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
                                                        ESP_EVENT_ANY_ID,
                                                        &wifi_event_handler,
                                                        NULL,
                                                        &instance_any_id));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,
                                                        IP_EVENT_STA_GOT_IP,
                                                        &ip_event_handler,
                                                        NULL,
                                                        &instance_got_ip));

    wifi_config_t wifi_config = {};
    constexpr std::size_t wifiSsidLength = sizeof(WIFI_SSID) - 1;
    constexpr std::size_t wifiPassLength = sizeof(WIFI_PASS) - 1;
    static_assert(wifiSsidLength <= sizeof(wifi_config.sta.ssid),
                  "WIFI_SSID is too long");
    static_assert(wifiPassLength < sizeof(wifi_config.sta.password),
                  "WIFI_PASS is too long");
    std::memcpy(wifi_config.sta.ssid, WIFI_SSID, wifiSsidLength);
    std::memcpy(wifi_config.sta.password, WIFI_PASS, wifiPassLength + 1);
    wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;


    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA) );
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config) );
    ESP_ERROR_CHECK(esp_wifi_start() );

    ESP_LOGI(TAG, "wifi_init_sta finished.");
}


void onMqttConnect(esp_mqtt_client_handle_t client)
{
    if (mqttClient.isMyTurn(client))
    {
        mqttClient.subscribe("foo", [](const std::string &payload)
                             { ESP_LOGI(TAG, "%s: %s", "foo", payload.c_str()); });

        mqttClient.subscribe("bar/#", [](const std::string &topic, const std::string &payload)
                             { ESP_LOGI(TAG, "%s: %s", topic.c_str(), payload.c_str()); });
    }
}

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
esp_err_t handleMQTT(esp_mqtt_event_handle_t event)
{
    mqttClient.onEventCallback(event);
    return ESP_OK;
}
#else
void handleMQTT(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
    (void)base;
    (void)event_id;
    auto *client = static_cast<ESP32MQTTClient *>(handler_args);
    auto *event = static_cast<esp_mqtt_event_handle_t>(event_data);
    client->onEventCallback(event);
}
#endif

static void main_task(void *pvParameters)
{
    int pubCount = 0;
    while(1) {
        if (mqttClient.isConnected()) {
            std::string msg = "Hello: " + std::to_string(pubCount++);
            mqttClient.publish("bar/bar", msg, 0, false);
        }
        vTaskDelay(2000 / portTICK_PERIOD_MS);
    }
}

extern "C" void app_main(void)
{
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    mqttClient.enableDebuggingMessages();
    mqttClient.setURI(MQTT_URI);
    mqttClient.enableLastWillMessage("lwt", "I am going offline");
    mqttClient.setKeepAlive(30);
    mqttClient.setOnMessageCallback([](const std::string &topic, const std::string &payload) {
        ESP_LOGI(TAG, "Global callback: %s: %s", topic.c_str(), payload.c_str());
    });

    wifi_init();

    xTaskCreate(&main_task, "main_task", 4096, NULL, 5, NULL);
}
